Tekla Open API Reference for Tekla Structures 2025
IPreferredPlacing Properties
The IPreferredPlacing type exposes the following members.
Properties
Name | Description
PreferredPlacing
 The type of placing the object should use. See PreferredPlacingTypes for different types of placing.
Top
See Also
Reference
IPreferredPlacing Interface
Tekla.Structures.Drawing Namespace